Unifi/test/test_SOAP/SmacWiFiReadServiceFields.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bpm="http://www.bercut.com/schema/BPM7Integration">
    <soapenv:Header/>
    <soapenv:Body>
        <bpm:readTableRequest>
            <bpm:UserName>service.sap.bpmint</bpm:UserName>
            <bpm:RootSchemaName>UsrSpecificationInSI</bpm:RootSchemaName>
            <bpm:Columns>
                <bpm:Items>
                    <bpm:Name>[UsrSpecification:Id:Specification].Name</bpm:Name>
                </bpm:Items>
                <bpm:Items>
                    <bpm:Name>UsrIsRequired</bpm:Name>
                </bpm:Items>
                <bpm:Items>
                    <bpm:Name>Specification.Id</bpm:Name>
                </bpm:Items>
                <bpm:Items>
                    <bpm:Name>[UsrSpecification:Id:Specification].Description</bpm:Name>
                </bpm:Items>
                <bpm:Items>
                    <bpm:Name>[UsrSpecification:Id:Specification].[SpecificationType:Id:Type].Name</bpm:Name>
                </bpm:Items>
                <bpm:Items>
                    <bpm:Name>[UsrSpecification:Id:Specification].[Lookup:Id:UsrLookup].SysEntitySchemaUId</bpm:Name>
                </bpm:Items>
                <bpm:Items>
                    <bpm:Name>[UsrSpecification:Id:Specification].[Lookup:Id:UsrLookup].[SysSchema:UId:SysEntitySchemaUId].Name</bpm:Name>
                </bpm:Items>
            </bpm:Columns>
            <bpm:Filters>
                <bpm:RootSchemaName>UsrSpecificationInSI</bpm:RootSchemaName>
                <bpm:FilterType>6</bpm:FilterType>
                <bpm:LogicalOperation>And</bpm:LogicalOperation>
                <bpm:Items>
                    <bpm:FilterType>1</bpm:FilterType>
                    <bpm:ComparisonType>Equal</bpm:ComparisonType>
                    <bpm:LeftExpression>
                        <bpm:ColumnPath>UsrServiceItem</bpm:ColumnPath>
                        <bpm:ExpressionType>0</bpm:ExpressionType>
                    </bpm:LeftExpression>
                    <bpm:RightExpression>
                        <bpm:ExpressionType>2</bpm:ExpressionType>
                        <bpm:Parameter>
                            <bpm:DataValueType>1</bpm:DataValueType>
                            <bpm:Value>A0A0F1BA-3AE6-4D70-9A42-0EFD60F80A42</bpm:Value>
                        </bpm:Parameter>
                    </bpm:RightExpression>
                </bpm:Items>
                <bpm:Items>
                    <bpm:FilterType>1</bpm:FilterType>
                    <bpm:ComparisonType>Equal</bpm:ComparisonType>
                    <bpm:LeftExpression>
                        <bpm:ColumnPath>UsrIsRequired</bpm:ColumnPath>
                        <bpm:ExpressionType>0</bpm:ExpressionType>
                    </bpm:LeftExpression>
                    <bpm:RightExpression>
                        <bpm:ExpressionType>2</bpm:ExpressionType>
                        <bpm:Parameter>
                            <bpm:DataValueType>12</bpm:DataValueType>
                            <bpm:Value>True</bpm:Value>
                        </bpm:Parameter>
                    </bpm:RightExpression>
                </bpm:Items>
            </bpm:Filters>
        </bpm:readTableRequest>
    </soapenv:Body>
</soapenv:Envelope>